## Minh họa Pandas - DataFrame

In [1]:
# Import thư viện
import numpy as np
import pandas as pd

### Tạo DataFrame

In [2]:
#Tạo dataframe từ list

#df1=pd.DataFrame(['1','2','3'])
#df1

df1=pd.DataFrame([['An','19'],['Hoa',25]])
#df1

#df1=pd.DataFrame([['An','19'],['Hoa',25]],columns=['Ten','Tuoi'])
df1

     0   1
0   An  19
1  Hoa  25

In [5]:
#Tạo dataframe từ list dictionary

df2 = pd.DataFrame([{'Ten':'An','Tuoi':19},{'Ten':'Hoa','Tuoi':25}])
print(df2)

df2 = pd.DataFrame({'Ten':['An','Hoa'],'Tuoi':[19,25]})
print(df2)

#df2 = pd.DataFrame({'Ten':['An','Hoa','Trung'],'Tuoi':[19,25,30]}) 
#print(df2)

df2 = pd.DataFrame([{'Ten':'Lan','Diachi':'Q1'},{'Ten':'Hoa','Diachi':'Q2'},{'Ten': 'Trung'}])
print(df2)

   Ten  Tuoi
0   An    19
1  Hoa    25
   Ten  Tuoi
0   An    19
1  Hoa    25
     Ten Diachi
0    Lan     Q1
1    Hoa     Q2
2  Trung    NaN

In [ ]:
df3 = pd.concat([df1,df2],sort=False,axis=1,join='inner')
df3

In [ ]:
df4 = pd.concat([df1,df2],sort=False,axis=1,join='outer')
df4

In [ ]:
df5 = pd.merge(df1,df2,how='inner')
df5

In [ ]:
df5 = pd.merge(df1,df2,how='outer')
df5

In [ ]:
df5 = pd.merge(df1,df2,how='left')
df5

In [ ]:
df5 = pd.merge(df1,df2,how='right')
df5

In [6]:
#Tạo data frame từ list dictionary 
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
# 2 cột, tên cột là tên key của dictionary
df1 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b'])

# 2 cột, tên một cột là tên key của dictionary, tên một cột khác
df2 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b1'])
print(df1)
print(df2)

        a   b
first   1   2
second  5  10
        a  b1
first   1 NaN
second  5 NaN

In [7]:
df21 = pd.DataFrame(data, index=['first', 'second'])
print(df21)

df22 = pd.DataFrame(data)
print(df22)

        a   b     c
first   1   2   NaN
second  5  10  20.0
   a   b     c
0  1   2   NaN
1  5  10  20.0

In [8]:
#Tạo dataframe từ dictionary series

#Tạo dataframe từ dictionary series
data={'Ten':pd.Series(['Hoa','An','Trung']), 'Tuoi':pd.Series([19,25,40])}
df3 = pd.DataFrame(data)

print(df3)
print(df3.dtypes)

     Ten  Tuoi
0    Hoa    19
1     An    25
2  Trung    40
Ten     object
Tuoi     int64
dtype: object

### Thao tác trên cột: lấy dữ liệu, thêm cột, xóa cột

In [16]:
# Create a DataFrame from Dict of Series
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
      'two' : pd.Series([11, 5, 6, 4], index=['a', 'b', 'c', 'd']),
      'three' : pd.Series([7, 4, 9], index=['a', 'b', 'c']),
    }

df5 = pd.DataFrame(d, columns = ['one', 'two', 'three'])
df5

   one  two  three
a  1.0   11    7.0
b  2.0    5    4.0
c  3.0    6    9.0
d  NaN    4    NaN

In [ ]:
df5['two'].plot.hist(bins=4)

In [11]:
# lấy dữ liệu theo cột
print(df5)
print("Lấy cột 'one':")
print(df5[['one','two']])
print(df5.one)

   one  two  three
a  1.0   11    7.0
b  2.0    5    4.0
c  3.0    6    9.0
d  NaN    4    NaN
Lấy cột 'one':
   one  two
a  1.0   11
b  2.0    5
c  3.0    6
d  NaN    4
a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [17]:
# Thêm cột mới

df5['four']=pd.Series([10,20,30, 40,50],
                      index=['a','b','c','d','e'])
print(df5)

   one  two  three  four
a  1.0   11    7.0    10
b  2.0    5    4.0    20
c  3.0    6    9.0    30
d  NaN    4    NaN    40

In [13]:
# using del function
print ("Dùng del:")
del df5['three']
print(df5)

Dùng del:
   one  two  four
a  1.0   11    10
b  2.0    5    20
c  3.0    6    30
d  NaN    4    40

In [18]:
#using drop
print(df5)
df7 = df5.drop(labels=['two','four'], axis=1)
print(df7)

   one  two  three  four
a  1.0   11    7.0    10
b  2.0    5    4.0    20
c  3.0    6    9.0    30
d  NaN    4    NaN    40
   one  three
a  1.0    7.0
b  2.0    4.0
c  3.0    9.0
d  NaN    NaN

In [19]:
df5

   one  two  three  four
a  1.0   11    7.0    10
b  2.0    5    4.0    20
c  3.0    6    9.0    30
d  NaN    4    NaN    40

In [14]:
# Xóa cột
# using pop function
print(df5)
print ("Dùng pop để xóa cột one")
df6=df5.pop('one')
print(df5)
print ("df6") # df6 chứa cột  bị xóa
print(df6)

   one  two  four
a  1.0   11    10
b  2.0    5    20
c  3.0    6    30
d  NaN    4    40
Dùng pop để xóa cột one
   two  four
a   11    10
b    5    20
c    6    30
d    4    40
df6
a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [ ]:
print(df5)

# Thao tác trên dòng: lấy dữ liệu, thêm dòng, xóa dòng

In [20]:
# lấy dữ liệu trên dòng loc- iloc

d = {'name' : pd.Series(['An', 'Hoa', 'Trung','Huy','Thanh','Dung'], index=[49,48,47, 1, 2, 3]),
      'age' : pd.Series([15, 22, 36,27,55],index=[49,48,47, 1, 3])
    }
                         
df=pd.DataFrame(d,columns=['name','age'])
print('Dataframe\n',df)

## Lấy dữ liệu theo loc - iloc

#loc

print('Giá trị dòng 3- cột name là:', df.loc[3,'name'])

#iloc
print('Giá trị dòng index 3- cột name là:',df.iloc[3,0])
print('Giá trị dòng index 4- cột name là:',df.iloc[4,0])

print('Lọc những nhân viên có tuổi >30: \n', df.loc[df['age']>30])

print('Lọc tên những nhân viên có tuổi >30: \n', df.loc[df['age']>30,'name'])

Dataframe
      name   age
1     Huy  27.0
2   Thanh   NaN
3    Dung  55.0
47  Trung  36.0
48    Hoa  22.0
49     An  15.0
Giá trị dòng 3- cột name là: Dung
Giá trị dòng index 3- cột name là: Trung
Giá trị dòng index 4- cột name là: Hoa
Lọc những nhân viên có tuổi >30:
      name   age
3    Dung  55.0
47  Trung  36.0
Lọc tên những nhân viên có tuổi >30:
 3      Dung
47    Trung
Name: name, dtype: object

In [22]:
#Cập nhật dữ liệu
print(df)
print (' Trước khi cập nhật: ', df.loc[df['name']=='Huy'].age.values[0])

df.loc[df['name']=='Huy','age'] = 37

print (' Sau khi cập nhật: ', df.loc[df['name']=='Huy'].age.values[0])

     name   age
1     Huy  37.0
2   Thanh   NaN
3    Dung  55.0
47  Trung  36.0
48    Hoa  22.0
49     An  15.0
 Trước khi cập nhật:  37.0
 Sau khi cập nhật:  37.0

In [23]:
# Minh họa set_index
print(df)
df4 = df.set_index(keys=['name'])
df4

     name   age
1     Huy  37.0
2   Thanh   NaN
3    Dung  55.0
47  Trung  36.0
48    Hoa  22.0
49     An  15.0

        age
name
Huy    37.0
Thanh   NaN
Dung   55.0
Trung  36.0
Hoa    22.0
An     15.0

In [24]:
print('Tuổi của nhân viên Huy :',df4.loc['Huy','age'])

Tuổi của nhân viên Huy : 37.0

### Sắp xếp

In [32]:
data = [['Alex',23],['Jack',27],['Clarke',32]]
df5 = pd.DataFrame(data,index=[2,0,1], columns=['Name','Age'],dtype=float)
print(df5)

     Name   Age
2    Alex  23.0
0    Jack  27.0
1  Clarke  32.0

In [26]:
#Sắp df theo index
print(df5.sort_index(ascending=False))

# sắp xếp theo cột
print(df5.sort_index(axis=1))

     Name   Age
2    Alex  23.0
1  Clarke  32.0
0    Jack  27.0
    Age    Name
2  23.0    Alex
0  27.0    Jack
1  32.0  Clarke

In [33]:
#Sắp theo giá trị
# Sắp tên tăng dần
print(df5.sort_values(by='Name'))

# Sắp tuổi giảm dần
print(df5.sort_values(by='Age', ascending=False))

df5 = df5.append({'Name': 'Alex', 'Age': 20}, ignore_index=True)
# Sắp Name tăng dần , Age giảm dần
print(df5.sort_values(by=['Name','Age'], ascending=[True,False]))

     Name   Age
2    Alex  23.0
1  Clarke  32.0
0    Jack  27.0
     Name   Age
1  Clarke  32.0
0    Jack  27.0
2    Alex  23.0
     Name   Age
0    Alex  23.0
3    Alex  20.0
2  Clarke  32.0
1    Jack  27.0

In [35]:
#Xếp hạng các giá trị dữ liệu trong các cột của dataframe

print(df5)
print('Xếp hạng\n',df5.rank(method='min'))

     Name   Age
0    Alex  23.0
1    Jack  27.0
2  Clarke  32.0
3    Alex  20.0
Xếp hạng
    Name  Age
0   1.0  2.0
1   4.0  3.0
2   3.0  4.0
3   1.0  1.0

In [36]:
print (df)

     name   age
1     Huy  37.0
2   Thanh   NaN
3    Dung  55.0
47  Trung  36.0
48    Hoa  22.0
49     An  15.0

In [37]:
df['ratio'] = pd.Series([2.2 ,1.5, 2.5 , 5,  1.2,3.4],index=[49,48,47, 1, 2, 3])
df

     name   age  ratio
1     Huy  37.0    5.0
2   Thanh   NaN    1.2
3    Dung  55.0    3.4
47  Trung  36.0    2.5
48    Hoa  22.0    1.5
49     An  15.0    2.2

In [38]:
df['salary'] = df['ratio'] * 200000
df

     name   age  ratio     salary
1     Huy  37.0    5.0  1000000.0
2   Thanh   NaN    1.2   240000.0
3    Dung  55.0    3.4   680000.0
47  Trung  36.0    2.5   500000.0
48    Hoa  22.0    1.5   300000.0
49     An  15.0    2.2   440000.0

In [39]:
df['age_group'] = df['age'].map(lambda x: 1 if x> 30 else 2)
df

     name   age  ratio     salary  age_group
1     Huy  37.0    5.0  1000000.0          1
2   Thanh   NaN    1.2   240000.0          2
3    Dung  55.0    3.4   680000.0          1
47  Trung  36.0    2.5   500000.0          1
48    Hoa  22.0    1.5   300000.0          2
49     An  15.0    2.2   440000.0          2

In [42]:
df.isnull().any()

name         False
age           True
ratio        False
salary       False
age_group    False
dtype: bool

In [41]:
df.all()

name         True
age          True
ratio        True
salary       True
age_group    True
dtype: bool

In [43]:
import pandas as pd
x = pd.DataFrame(['a','b','c'])
x

   0
0  a
1  b
2  c

In [47]:
y=x.copy()
y

   0
0  z
1  b
2  c

In [45]:
y.loc[0,0]='z'
y

   0
0  z
1  b
2  c

In [46]:
x

   0
0  z
1  b
2  c